// #FILE: docme.hpp, Project Header File
// #BRIEF: Project wide header file

//  ██████████                                             
// ▒▒███▒▒▒▒███                                            
//  ▒███   ▒▒███  ██████   ██████  █████████████    ██████ 
//  ▒███    ▒███ ███▒▒███ ███▒▒███▒▒███▒▒███▒▒███  ███▒▒███
//  ▒███    ▒███▒███ ▒███▒███ ▒▒▒  ▒███ ▒███ ▒███ ▒███████ 
//  ▒███    ███ ▒███ ▒███▒███  ███ ▒███ ▒███ ▒███ ▒███▒▒▒  
//  ██████████  ▒▒██████ ▒▒██████  █████▒███ █████▒▒██████ 
// ▒▒▒▒▒▒▒▒▒▒    ▒▒▒▒▒▒   ▒▒▒▒▒▒  ▒▒▒▒▒ ▒▒▒ ▒▒▒▒▒  ▒▒▒▒▒▒  
                                                                            
#pragma once

#include "std.hpp" // #INCLUDE: std.hpp, Standard Library Includes

// #NAMESPACE: docme, Project Namespace
// #BRIEF: Main project namespace
namespace docme{

    namespace std_fs = std::filesystem; // #ALIAS: std_fs = std::filesystem, alias for std::filesystem

    namespace cli{}
    namespace engine{}
    namespace generator{}
    namespace gui{}

} // namespace docme